package com.minorius.smilaguide.mvp.transport;

import com.minorius.smilaguide.adapter.pojo.transport.Bus;
import com.minorius.smilaguide.adapter.pojo.transport.ExtraBus;
import com.minorius.smilaguide.adapter.pojo.transport.MarkerTransport;

import java.util.ArrayList;

/**
 * Created by minorius on 15.09.2017.
 */

public class Data{

        public static ArrayList<MarkerTransport> getListCityBus(){
            ArrayList<MarkerTransport> busList = new ArrayList<>();

            busList.add(new Bus("Маршрут №3 „АС-2 – вулиця Котовського”", "АС-2:\n" +
                    "06-35 08-20 10-10 14-40 16-45\n" +
                    "вул. Котовського:\n" +
                    "07-25 09-15 11-00 15-25 17-15"));
            busList.add(new Bus("Маршрут №4 „Вулиця Громова – табір „Тимурівець”", "Вулиця Громова\n" +
                    "06-35 07-28 07-30 08-20 09-00 09-20 09-50 10-50 11-20 11-40 12-25\n" +
                    "13-30 14-00 16-00 16-30 17-40 18-30\n" +
                    "Табір „Тимурівець”\n" +
                    "06-48 07-48 08-20 08-40 09-05 09-40 10-20 10-35 11-30 12-35 13-10\n" +
                    "14-55 16-30 17-20 18-30 19-20 "));
            busList.add(new Bus("Маршрут №5 „Вулиця Федорова – будинок культури СЕМЗ”", "Вулиця Федорова:\n" +
                    "06-55(Костян.) 07-30 08-15(Костян.) 08-55 09-40 10-15 10-50 11-25 12-00 13-10\n" +
                    "13-30 14-50 15-25 16-10 16-55 17-40 18-15 19-00 19-20\n" +
                    "Будинок культури СЕМЗ:\n" +
                    "06-55 07-35 08-10 08-55 09-25 10-10 10-50 11-25 11-55 12-40 14-10\n" +
                    "15-30 16-10 16-55 17-35 18-10 18-50 19-30 "));
            busList.add(new Bus("Маршрут №9 „Вулиця Глібова – станція ім.Т.Шевченка – міська лікарня”", "Вулиця Глібова:\n" +
                    "08-10 09-25 10-55 12-55 14-05\n" +
                    "Станція ім. Т. Шевченка:\n" +
                    "07-55 12-40\n" +
                    "Міська лікарня:\n" +
                    "08-50 10-05 13-30\n"));
            busList.add(new Bus("Маршрут №10 „Станція ім. Т. Шевченка–вул. Кармелюка-АС-1”", "Станція ім. Т. Шевченка:\n" +
                    "07-26 09-04 10-52 12-06 15-05 16-49 18-35\n" +
                    "АС – 1:\n" +
                    "08-10 10-03 11-27 12-48 15-48 17-32 19-18\n"));
            busList.add(new Bus("Маршрут №13 „Вулиця Кармелюка – станція Сміла”", "Вулиця Кармелюка:\n" +
                    "06-55 07-50 08-50\n" +
                    "Станція Сміла:\n" +
                    "07-25 08-25 09-25"));
            busList.add(new Bus("Маршрут №17 „Станція ім. Т. Шевченка – АС-1”", "Станція ім. Т. Шевченка:\n" +
                    "06-15 06-41 06-54 07-05 07-18 07-29 07-45 08-01 08-09 08-28 08-36\n" +
                    "08-51 09-07 09-17 09-30 09-47 10-00 10-16 10-25 10-38 10-48 11-12\n" +
                    "11-27 11-42 11-58 12-28 12-12 12-43 12-55 13-19 13-33 13-47 14-02\n" +
                    "14-17 14-28 14-40 14-54 15-08 15-23 15-36 15-48 16-08 16-19 16-29\n" +
                    "16-45 16-59 17-09 17-22 17-42 17-54 18-06 18-22 18-30 18-48\n" +
                    "АС -1:\n" +
                    "06-46 07-13 07-29 07-38 07-55 08-03 08-19 08-35 08-43 09-00 09-16\n" +
                    "09-23 09-39 09-48 10-05 10-17 10-32 10-49 11-16 11-28 11-40 11-57\n" +
                    "12-19 12-21 13-02 12-45 12-59 13-16 13-28 13-40 13-55 14-07 14-24\n" +
                    "14-38 14-48 15-04 15-18 15-28 15-38 15-58 16-12 16-25 16-39 16-52\n" +
                    "17-10 17-22 17-34 17-48 17-56 18-15 18-24 18-36 19-00"));
            busList.add(new Bus("Маршрут №18 „Школа-інтернат №8 – міська лікарня”", "Міська лікарня:\n" +
                    "07-00 08-00 09-00 10-00 11-00 12-00 13-00 15-00* 16-00* 17-00*\n" +
                    "Школа-інтернат №8:\n" +
                    "07-30 08-30 09-30 10-30 11-30 12-30 13-30 15-30* 16-30* 17-30*\n" +
                    "* крім суботи та неділі \n"));
            busList.add(new Bus("Маршрут №30 „Станція ім. Т. Шевченка – АС-1”", "Станція ім. Т. Шевченка:\n" +
                    "05-54 06-10 06-50 06-58 07-06 07-14 07-22 07-30 07-38 07-46 07-54\n" +
                    "08-02 08-10 08-21 08-29 08-37 08-44 08-52 09-00 09-08 09-16 09-24\n" +
                    "09-31 09-39 09-47 09-55 10-03 10-10 10-18 10-26 10-34 10-41 10-48\n" +
                    "10-56 11-04 11-12 11-19 11-35 11-43 11-27 11-59 12-12 12-20 12-30\n" +
                    "12-40 12-43 12-51 12-54 13-08 13-09 13-16 13-27 13-39 13-49 14-00\n" +
                    "14-08 14-17 14-27 14-38 14-49 15-00 15-11 15-19 15-27 15-35 15-43\n" +
                    "15-51 15-59 16-06 16-13 16-21 16-29 16-37 16-45 16-53 17-01 17-12\n" +
                    "17-23 17-33 17-44 17-54 17-55 18-04 18-12 18-27 18-30 18-43 18-46 \n" +
                    "18-54 19-05 19-18 19-34 19-50 20-08 20-22 20-38 20-54 21-10 21-26\n" +
                    "21-35 21-50 22-10 22-30 22-50 23-25 24-00\n" +
                    "АС – 1:\n" +
                    "06-29 06-40 07-01 07-09 07-17 07-25 07-33 07-43 07-51 07-59 08-07\n" +
                    "08-15 08-23 08-31 08-39 08-47 08-56 09-04 09-12 09-20 09-27 09-35\n" +
                    "09-43 09-50 09-58 10-06 10-12 10-20 10-29 10-37 10-45 10-55 11-01\n" +
                    "11-09 11-23 11-33 11-39 11-43 11-53 11-55 12-01 12-09 12-17 12-19\n" +
                    "12-34 12-41 12-43 12-53 13-02 13-05 13-11 13-23 13-34 13-42 13-52\n" +
                    "14-02 14-12 14-21 14-33 14-43 14-52 15-02 15-14 15-24 15-31 15-43\n" +
                    "15-54 16-02 16-05 16-10 16-18 16-26 16-34 16-41 16-48 16-56 17-08\n" +
                    "17-20 17-28 17-36 17-44 17-52 18-02 18-10 18-20 18-30 18-42 18-54\n" +
                    "19-10 19-23 19-42 19-58 20-14 20-30 20-46 21-02 21-18 21-34 21-50\n" +
                    "22-15 22-45 23-15 23-40 00-10 00-30\n"));
            busList.add(new Bus("Маршрут №32 ,,Станція ім.Т.Шевченка–міська лікарня”\n" +
                    "(через РПЗ)", "Станція ім. Т. Шевченка:\n" +
                    "06-35 07-06 08-35 09-14 10-35 11-10 12-22 13-15 14-00 14-38* 16-25\n" +
                    "17-15* 18-20 19-42* 20-00\n" +
                    "Міська лікарня:\n" +
                    "07-30 08-14 09-30 10-00 11-20 12-00 15-20 15-56* 17-20 18-10* 19-00\n" +
                    "* крім суботи та неділі "));
            busList.add(new Bus("Маршрут №34 ,,Стадіон ,,Локомотив” - міська лікарня”","Стадіон ,,Локомотив”:\n" +
                    "06-45 06-52 07-12 07-30 07-43 07-52 08-12 08-40 08-45 09-22 09-35\n" +
                    "09-45 10-15 10-22 10-35 10-50 11-27 12-10 11-38 12-43 12-20 12-50\n" +
                    "13-20 13-57 14-10 14-28 14-30 14-40 15-15 15-27 15-35 15-50 16-15\n" +
                    "16-35 16-50 17-00\n" +
                    "Міська лікарня:\n" +
                    "07-12 07-20 07-42 08-16 08-20 08-40 08-50 09-10 09-35 09-50 10-05\n" +
                    "10-20 10-40 11-00 11-10 11-35 12-10 12-40 12-20 13-15 12-50 13-20\n" +
                    "13-56 14-20 14-40 15-00 15-00 15-20 15-45 16-05 16-00 16-20 17-00\n" +
                    "17-08 17-20 17-30\n"));
            busList.add(new Bus("Маршрут №35 ,,Стадіон ,,Локомотив – АС-2”","Стадіон ,,Локомотив” /Б.Хмельницького/:\n" +
                    "06-30 06-40 07-40 07-20 07-30 08-30 08-07 08-20 09-18 09-00 09-10\n" +
                    "10-10 09-50 10-00 11-00 10-15 10-25 10-50 11-30 11-40 12-20 12-00\n" +
                    "13-10 12-50 13-00 14-04 13-52 14-54 14-30 14-42 15-44 15-20 16-10\n" +
                    "16-22 17-24 17-00 17-02 18-14\n" +
                    "АС-2:\n" +
                    "06-55 07-05 08-05 07-45 07-55 08-53 08-35 08-45 09-45 09-25 09-38\n" +
                    "10-35 10-15 10-25 11-15 11-55 11-35 12-45 12-25 12-33 13-39 13-15\n" +
                    "13-27 14-29 14-05 14-17 15-19 14-55 15-45 15-57 17-02 16-35 16-47\n" +
                    "17-47 18-39 "));
            busList.add(new Bus("Маршрут №36 ,,Вулиця Громова – міська лікарня ”(через РПЗ)","Вулиця Громова:\n" +
                    "06-50 08-10 09-35 14-50 16-05\n" +
                    "Міська лікарня:\n" +
                    "07-25 08-55 10-30 15-30 17-00"));
            busList.add(new Bus("Маршрут №37 „Вулиця Некрасова – вулиця Стаханова – вулиця Федорова\n" +
                    "– АС-2”","Вулиця Некрасова\n" +
                    "07.25 09.10к\n" +
                    "вул.Стаханова\n" +
                    "08.05 09.40к 15.30к\n" +
                    "Вулиця Федорова\n" +
                    "08.25 10.00к\n" +
                    "к – рейс до кладовища „Загребля”"));
            busList.add(new Bus("Маршрут №39 ,,Вулиця Глібова – станція Сміла”","Вулиця Глібова:\n" +
                    "06-20 06-50 07-35 08-20 09-05 09-35 10-25 10-50 11-35 12-20 13-05\n" +
                    "13-40 14-15 14-50 15-35 16-00 17-00 17-20 18-35\n" +
                    "Станція Сміла:\n" +
                    "06-55 07-35 08-20 08-55 09-45 10-15 10-55 11-20 12-20 13-10 13-35\n" +
                    "14-10 14-50 15-15 16-20 16-40 17-40 17-50 19-05 "));
            busList.add(new Bus("Маршрут №40 ,,Вулиця Кармелюка – міська лікарня”","Вулиця Кармелюка:\n" +
                    "06-40 07-07* 07-35 08-07* 08-35 09-00* 09-30 09-45* 10-20 10-35*\n" +
                    "11-10 11-20* 12-00 12-15* 12-50 13-05* 13-40 13-55* 14-40 15-00*\n" +
                    "15-40 16-10 17-10* 17-55*\n" +
                    "Міська лікарня:\n" +
                    "07-10 07-40* 08-10 08-35* 09-05 09-20* 09-50 10-15* 10-45 11-00*\n" +
                    "11-35 11-45* 12-25 12-40* 13-15 13-30* 14-10 14-30* 15-00 15-40*\n" +
                    "16-10 16-40* 17-15 17-40* 18-20*\n" +
                    "* крім суботи та неділі "));
            busList.add(new Bus("Маршрут №41 ,,Вулиця Кармелюка – вулиця 60-Річчя СРСР” (вечірній)","Вулиця Кармелюка:\n" +
                    "18-20 19-25 20-35 21-35 22-35 23-30\n" +
                    "Вулиця 60-Річчя СРСР\n" +
                    "18-55 19-25 20-35 21-35 22-35 23-00\n"));
            busList.add(new Bus("Маршрут №45 „Мала Яблунівка – АС-1”","Мала Яблунівка:\n" +
                    "06-55* 08-35* 10-05* 12-10* 15-05* 16-35*\n" +
                    "АС-1:\n" +
                    "07-45* 09-30* 11-05* 13-15* 15-45* 17-15*\n" +
                    "* крім суботи та неділі \n"));
            busList.add(new Bus("Маршрут №48 „Вулиця Федорова – міська лікарня”","Вулиця Федорова:\n" +
                    "07-00 08-00 09-00 10-00 11-00 12-00 13-00 15-00* 16-00* 17-00*\n" +
                    "Міська лікарня:\n" +
                    "07-30 08-30 09-30 10-30 11-30 12-30 13-30 15-30* 16-30* 17-30*\n" +
                    "* крім суботи та неділі "));
            busList.add(new Bus("Маршрут №49 ,,Вулиця Глібова – міська лікарня”\n" +
                    "(через ст. ім. Т. Шевченка)","Вулиця Глібова:\n" +
                    "07-03 07-25 08-30 09-15 09-55 11-05 11-50 12-45 13-20 14-30 15-00\n" +
                    "16-15 16-30 17-40 17-55\n" +
                    "Міська лікарня:\n" +
                    "07-50 08-30 09-15 10-00 10-40 12-05 12-40 13-40 14-15 15-30 15-40\n" +
                    "17-00 17-10 18-15 18-30 "));
            return busList;
        }

    public static ArrayList<MarkerTransport> getListBusSmilaCherkasy() {
        ArrayList<MarkerTransport> list = new ArrayList<>();
        list.add(new Bus("06:30 - 07:40", "", "b=710705&r=16%CF"));
        list.add(new Bus("06:55 - 08:00", "", "b=710705&r=5452"));
        list.add(new Bus("07:15 - 08:25", "", "b=710705&r=12%CF"));
        list.add(new Bus("07:35 - 08:55", "", "b=710705&r=5009"));

        list.add(new ExtraBus("Новомиргород - Черкаси", "07:45 - 08:30", "b=354500&r=723"));

        list.add(new Bus("07:55 - 09:00", "", "b=710705&r=5158"));
        list.add(new Bus("08:15 - 09:25", "", "b=710705&r=5005"));
        list.add(new Bus("08:35 - 09:40", "", "b=710705&r=5154"));
        list.add(new Bus("09:00 - 10:10", "", "b=710705&r=17%CF"));
        list.add(new Bus("09:25 - 10:30", "", "b=710705&r=5400"));
        list.add(new Bus("09:50 - 10:55", "", "b=710705&r=5402"));
        list.add(new Bus("10:15 - 11:25", "", "b=710705&r=5011"));
        list.add(new Bus("10:35 - 11:40", "", "b=710705&r=5166"));
        list.add(new Bus("10:55 - 12:05", "", "b=710705&r=5001"));
        list.add(new Bus("11:15 - 12:20", "", "b=710705&r=5156"));
        list.add(new Bus("11:35 - 12:40", "", "b=710705&r=18%CF"));
        list.add(new Bus("11:55 - 13:05", "", "b=710705&r=13%CF"));

        list.add(new ExtraBus("Новомиргород - Черкаси", "12:10 - 12:45", "b=354500&r=704"));

        list.add(new Bus("12:15 - 13:20", "", "b=710705&r=5404"));
        list.add(new Bus("12:35 - 13:45", "", "b=710705&r=5406"));
        list.add(new Bus("12:55 - 14:05", "", "b=710705&r=5006"));
        list.add(new Bus("13:15 - 14:20", "", "b=710705&r=60%CF"));
        list.add(new Bus("13:35 - 14:45", "", "b=710705&r=5002"));
        list.add(new Bus("13:55 - 15:00", "", "b=710705&r=5160"));
        list.add(new Bus("14:15 - 15:20", "", "b=710705&r=14%CF"));
        list.add(new Bus("14:35 - 15:45", "", "b=710705&r=25%CF"));
        list.add(new Bus("14:55 - 16:15", "", "b=710705&r=131%CF"));
        list.add(new Bus("15:15 - 16:20", "", "b=710705&r=5410"));
        list.add(new Bus("15:35 - 16:45", "", "b=710705&r=5010"));

        list.add(new ExtraBus("Новомиргород - Черкаси", "15:45 - 16:30", "b=354500&r=727"));

        list.add(new Bus("15:55 - 17:00", "", "b=710705&r=5164"));
        list.add(new Bus("16:15 - 17:25", "", "b=710705&r=5422"));
        list.add(new Bus("16:35 - 17:40", "", "b=710705&r=61%CF"));
        list.add(new Bus("16:55 - 18:00", "", "b=710705&r=15%CF"));
        list.add(new Bus("17:15 - 18:25", "", "b=710705&r=5412"));
        list.add(new Bus("17:35 - 18:55", "", "b=710705&r=133%CF"));
        list.add(new Bus("17:55 - 19:00", "", "b=710705&r=5419"));
        list.add(new Bus("18:15 - 19:20", "", "b=710705&r=5007"));
        list.add(new Bus("18:35 - 19:40", "", "b=710705&r=5168"));
        list.add(new Bus("18:55 - 20:00", "", "b=710705&r=5003"));

        list.add(new ExtraBus("Новомиргород - Черкаси", "19:00 - 19:40",  "b=354500&r=678"));

        list.add(new Bus("19:15 - 20:20", "", "b=710705&r=62%CF"));
        list.add(new Bus("19:35 - 20:40", "", "b=710705&r=5417"));
        list.add(new Bus("20:05 - 21:10", "", "b=710705&r=63%CF"));
        list.add(new Bus("20:45 - 21:50", "", "b=710705&r=508%CF"));
        return list;
    }

    public static ArrayList<MarkerTransport> getListBusCherkasySmila() {
        ArrayList<MarkerTransport> list = new ArrayList<>();
        list.add(new Bus("06:10 - 07:15", "", "b=712000&r=226%CF"));
        list.add(new Bus("06:30 - 07:30", "", "b=712000&r=153%CF"));
        list.add(new Bus("06:50 - 07:55", "", "b=712000&r=227%CF"));
        list.add(new Bus("07:15 - 08:15", "", "b=712000&r=155%CF"));

        list.add(new ExtraBus("Черкаси - Новомиргород", "07:40 - 08:24", "b=712000&r=703"));

        list.add(new Bus("07:55 - 08:55", "", "b=712000&r=397%CF"));
        list.add(new Bus("08:15 - 09:00", "", "b=712000&r=43%CF"));
        list.add(new Bus("08:25 - 09:30", "", "b=712000&r=137%CF"));
        list.add(new Bus("08:35 - 09:35", "", "b=712000&r=399%CF"));
        list.add(new Bus("08:55 - 10:00", "", "b=712000&r=4%CF"));
        list.add(new Bus("09:10 - 10:10", "", "b=712000&r=157%CF"));
        list.add(new Bus("09:35 - 10:40", "",  "b=712000&r=228%CF"));
        list.add(new Bus("09:55 - 10:55", "", "b=712000&r=159%CF"));
        list.add(new Bus("10:15 - 11:15", "", "b=712000&r=401%CF"));
        list.add(new Bus("10:35 - 11:15", "", "b=712000&r=45%CF"));
        list.add(new Bus("10:55 - 11:55", "", "b=712000&r=403%CF"));

        list.add(new ExtraBus("Черкаси - Новомиргород", "11:00 - 11:44", "b=712000&r=2724"));

        list.add(new Bus("11:15 - 12:05", "", "b=712000&r=405%CF"));
        list.add(new Bus("11:35 - 12:40", "", "b=712000&r=229%CF"));
        list.add(new Bus("11:55 - 12:55", "", "b=712000&r=163%CF"));
        list.add(new Bus("12:15 - 13:20", "", "b=712000&r=230%CF"));
        list.add(new Bus("12:35 - 13:35", "", "b=712000&r=165%CF"));
        list.add(new Bus("12:55 - 13:55", "", "b=712000&r=47%CF"));
        list.add(new Bus("13:15 - 14:00", "", "b=712000&r=67%CF"));
        list.add(new Bus("13:35 - 14:35", "", "b=712000&r=230%CF"));
        list.add(new Bus("13:55 - 14:55", "", "b=712000&r=411%CF"));
        list.add(new Bus("14:15 - 15:20", "", "b=712000&r=231%CF"));
        list.add(new Bus("14:35 - 15:35", "", "b=712000&r=167%CF"));
        list.add(new Bus("14:55 - 16:00", "", "b=712000&r=7%CF"));

        list.add(new ExtraBus("Черкаси - Новомиргород", "15:00 - 15:39", "b=712000&r=677"));

        list.add(new Bus("15:15 - 16:15", "", "b=712000&r=198%CF"));
        list.add(new Bus("15:35 - 16:20", "", "b=712000&r=69%CF"));
        list.add(new Bus("15:55 - 16:55", "", "b=712000&r=408%CF"));
        list.add(new Bus("16:15 - 17:20", "", "b=712000&r=132%CF"));
        list.add(new Bus("16:35 - 17:35", "", "b=712000&r=413%CF"));
        list.add(new Bus("16:55 - 18:00", "", "b=712000&r=232%CF"));
        list.add(new Bus("17:15 - 18:15", "", "b=712000&r=199%CF"));
        list.add(new Bus("17:35 - 18:40", "", "b=712000&r=233%CF"));
        list.add(new Bus("17:55 - 18:55", "", "b=712000&r=200%CF"));

        list.add(new ExtraBus("Черкаси - Новомиргород", "18:00 - 18:44", "b=712000&r=728"));

        list.add(new Bus("18:15 - 19:00", "", "b=712000&r=71%CF"));
        list.add(new Bus("18:35 - 19:35", "", "b=712000&r=415%CF"));
        list.add(new Bus("18:55 - 20:00", "", "b=712000&r=134%CF"));
        list.add(new Bus("19:15 - 20:15", "", "b=712000&r=417%CF"));
        list.add(new Bus("19:35 - 20:40", "", "b=712000&r=234%CF"));
        list.add(new Bus("20:05 - 21:10", "", "b=712000&r=235%CF"));

        return list;
    }

    public static ArrayList<MarkerTransport> getListBusOutCity(){
        ArrayList<MarkerTransport> list = new ArrayList<>();
        list.add(new Bus("Маршрут № 112 «м. Сміла АС-2 – с. Миколаївка – с. М.Смілянка»\n" +
                "(ч/з с.Холоднянське)","м. Сміла АС-3:\n" +
                "до с. М.Смілянка – 7-05(п), 11-45, 17-00(п)\n" +
                "\n" +
                "м. Сміла (лікарня ім. Семашка):\n" +
                "до с. М.Смілянка – 9-15\n" +
                "\n" +
                "с. М.Смілянка:\n" +
                "7-30(п), 9-45, 12-25"));
        list.add(new Bus("Маршрут № 123 «м. Сміла АС-2 – с. Куцівка»\n" +
                "(ч/з с. Ротмістрівка)","м. Сміла АС-2:\n" +
                "5-20(п), 12-25, 16-55(п)\n" +
                "\n" +
                "с. Куцівка:\n" +
                "6-25(п), 13-30, 18-00"));
        list.add(new Bus("Маршрут № 125 «м. Сміла АС-2 – с. Ковалиха»\n" +
                "(ч/з с. Холоднянське, с. М. Смілянка, с. Тернівка, с. Попівка, с. Ковалиха)","м. Сміла АС-2:\n" +
                "до с. Ковалиха – 6-55(п), 14-00\n" +
                "до с. Попівка – 10-05, 16-30\n" +
                "\n" +
                "с. Ковалиха:\n" +
                "7-45(п), 15-00\n" +
                "\n" +
                "с. Попівка:\n" +
                "10-55, 17-25"));
        list.add(new Bus("Маршрут № 124 «м. Сміла АС-2 – с. Ковалиха»\n" +
                "(ч/з с. Холоднянське)","м. Сміла АС-2:\n" +
                "6-15 (крім вихідних та святкових), 11-15(п), 17-15\n" +
                "\n" +
                "с. Ковалиха:\n" +
                "6-55 (крім вихідних та святкових), 11-55, 17-55"));
        list.add(new Bus("Маршрут № 126 «м. Сміла АС-3 – с. Б.Маківка»\n" +
                "(ч/з с. Ротмістрівка, с. Ташлик, с. Самгородок, с. Макіївка)","м. Сміла АС-3:\n" +
                "5-30 ( до с. Макіївка)(п), 11-00, 15-45(п)\n" +
                "с. Макіївка:\n" +
                "7-30(п)\n" +
                "\n" +
                "с. Б. Макіївка:\n" +
                "12-45, 17-30"));
        list.add(new Bus("\n" +
                "Маршрут № 127 «м. Сміла АС-3 – с. Пастирське»\n" +
                "(ч/з с. Ротмістрівка, с. Ташлик)","м. Сміла АС-3:\n" +
                "5-20(п), 13-20(п), 17-15 (до с.Ташлик)\n" +
                "\n" +
                "с. Пастирське:\n" +
                "7-00(п), 15-05\n" +
                "\n" +
                "с. Ташлик:\n" +
                "18-20"));
        list.add(new Bus("Маршрут № 129 «м. Сміла АС-3 – с. М. Старосілля»\n" +
                "(ч/з с. Костянтинівка, с. Балаклея, с. М. Старосілля)","м. Сміла АС-3:\n" +
                "10-55, 13-50, 17-00\n" +
                "м. Сміла АС-1:\n" +
                "7-41, 11-15, 14-10, 17-20\n" +
                "м. Сміла (центр):\n" +
                "6-15, 7-30\n" +
                "\n" +
                "с. М.Старосілля:\n" +
                "7-01, 8-40, 12-15, 15-00, 18-20"));
        list.add(new Bus("Маршрут № 135 «м. Сміла АС-2 – с. Сунки»","м. Сміла АС-2:\n" +
                "6-20\n" +
                "\n" +
                "с. Сунки:\n" +
                "6-40"));
        list.add(new Bus("Маршрут № 135 «м. Сміла АС-2 – с. Плескачівка»\n" +
                "(ч/з с. Сунки, х. Шевченко)","м. Сміла АС-2:\n" +
                "7-05(п), 13-00, 15-45(п)\n" +
                "\n" +
                "с. Плескачівка:\n" +
                "8-00(п), 14-00, 17-00"));
        list.add(new Bus("Маршрут № 136 «м. Сміла  – с. Залевки»","м. Сміла АС-3:\n" +
                "6-26, 11-22, 14-22, 16-57\n" +
                "\n" +
                "с. Залевки:\n" +
                "7-15, 11-50, 14-50, 17-50"));
        list.add(new Bus("Маршрут № 137 «м. Сміла  – с. М.Бузуків»\n" +
                "(ч/з с. Сунки, с. Голов’ятино)","м. Сміла АС-2:\n" +
                "6-40(п), 10-00 (до с. Сунки), 11-40, 17-30(п)\n" +
                "\n" +
                "с.Сунки:\n" +
                "10-35\n" +
                "с. М.Бузуків:\n" +
                "7-30(п), 12-25, 18-20"));
        list.add(new Bus("Маршрут № 139 «м. Сміла АС-2 – с. Санжариха»\n" +
                "(ч/з с. Холоднянське, с. М. Смілянка, с. Тернівка, с. Попівка)","м. Сміла АС-2:\n" +
                "5-20(п), 7-25, 12-00, 17-55(п)\n" +
                "\n" +
                "с. Санжариха:\n" +
                "6-15, 8-10(п), 13-10, 18-50"));
        list.add(new Bus("Маршрут № 140 «м. Сміла АС-2  – с. Березняки»\n" +
                "(ч/з М. Яблунівка, с. В. Яблунівка)","м. Сміла АС-2:\n" +
                "6-30, 7-25(п), 9-15, 10-40, 12-45, 14-25(п), 16-30, 17-50, 18-50, 19-50\n" +
                "\n" +
                "м. Сміла АС-3:\n" +
                "5-20, 6-25\n" +
                "\n" +
                "с. Березняки:\n" +
                "6-10, 7-00, 7-30, 8-30(п), 10-10, 11-55, 14-10, 15-30, 17-40, 18-45, 19-50, 20-45"));
        list.add(new Bus("Маршрут № 141 «ст. Шевченко  – с. Будки»","м. Сміла АС-3:\n" +
                "6-20, 8-05, 11-15, 13-15, 15-15, 17-28\n" +
                "\n" +
                "с. Будки:\n" +
                "7-05, 9-10, 12-10, 14-10, 16-10, 18-25"));
        list.add(new Bus("Маршрут № 150 «с. В.Яблунівка - Райлікарня»\n" +
                "(ч/з М.Яблунівка)","Районна лікарня:\n" +
                "6-20, 7-15(п), 8-00, 8-50, 9-30, 10-30, 12-00, 12-30(п), 13-50, 14-40, 15-10, 16-05, 16-50, 17-30, 18-10, 18-45\n" +
                "\n" +
                "с. В.Яблунівка:\n" +
                "5-45, 6-30, 7-00, 8-05, 8-45(п), 9-40, 10-30, 11-20, 12-50, 13-50, 14-35, 15-20, 16-15, 16-50, 17-35, 18-10, 19-00"));
        list.add(new Bus("Маршрут № 151 «Райлікарня – с. Тернівка»\n" +
                "(ч/з с. Холоднянське, с. М.Смілянка)","Районна лікарня:\n" +
                "6-10, 9-30, 10-50, 12-10(п), 19-50\n" +
                "с. Тернівка:\n" +
                "6-50(п), 10-10, 11-30, 12-50, 20-30"));
        list.add(new Bus("Маршрут № 152 «Районна лікарня – с. Теклине»\n" +
                "(ч/з с. Костянтинівка, с. Балаклея)","Районна лікарня:\n" +
                "6-20(п), 8-10, 9-50, 11-40, 15-00(п), 16-55, 18-45\n" +
                "\n" +
                "с. Теклине:\n" +
                "7-00, 9-00(п), 10-50, 12-20, 16-00, 17-50, 19-30\n"));
        list.add(new Bus("Маршрут № 153 «м. Сміла АС-3 – с. Балаклея ст. Володимирівка»\n" +
                "(ч/з с. Костянтинівка)","м. Сміла АС-3:\n" +
                "5-40, 8-10, 10-40, 13-00(п), 17-20\n" +
                "\n" +
                "ст. Володимирівка:\n" +
                "6-40, 9-30(п), 11-50, 14-40, 18-30"));
        list.add(new Bus("Маршрут № 154 «Райлікарня – с. Сердюківка»\n" +
                "(ч/з с. Холоднянське, с. М.Смілянка, с. Тернівка, с. Попівка, х. Червоний)","Районна лікарня:\n" +
                "7-20, 14-30(п), 17-00\n" +
                "\n" +
                "с. В.Яблунівка:\n" +
                "8-20(п), 15-30, 18-00"));
        list.add(new Bus("Маршрут № 155 «Районна лікарня – с. Ротмістрівка»\n" +
                "(ч/з с. Холоднянське, с. Миколаївка)","Районна лікарня:\n" +
                "5-55(п), 7-50, 10-30, 13-20(п), 16-45\n" +
                "\n" +
                "с. Ротмістрівка (аеродром):\n" +
                "6-50, 8-55(п), 12-15, 14-35, 18-25"));

        return list;
    }

}
